<%@ page contentType="text/html;charset=UTF-8" %>
<h1>SPA</h1>
<p>
  <strong>SPA</strong> - Single Page Application. Підхід до розробки
  вебзастосунку (сторінки) з мінімальною кількістю її перезавантажень.
  Переходи між сторінками імітуються, тобто сама сторінка не оновлюється,
  а змінюється контент окремих її елементів (контейнерів).
  За вимогами безпеки оновлюватись сторінка зобов'язана при зміні
  стану авторизації (як при вході, так і при виході).
</p>
<p>
  На заміну серверних сесій приходить локальні сховища, які, аналогічно
  до сесій, зберігають дані між оновленнями сторінки.
</p>
<div>
  <button id="spa-btn-logout" class="btn">Log out</button>
  <button id="spa-btn-get-info" class="btn">Get info</button>
</div>
<div id="spa-container"></div>
